title: OT/ICS in Threatscape
status: 'Process_Creation'
description: Specifications are from the analyzation -Chaya_003

         - With this was an opposition of 'Document and Product Design' Technician but in this case the Developer/ DEV. The
          Development Board or DEV Board works as such DEV source window LorRa, LoRaWAN I/O modules feature wireless I/O sensor
          nodes based on LoRa network Technologies targeting both indoor and outdoor application. This respository is for both 
          Cloud and non -Cloud applications. As a Protocol Combined for (M2M) Machine to Machine technologies. In this case the 
          Mainframe. Sometimes the REST API/REST Application inbetween is varible of this. Everything here is explained in detail 
          from the Development Board or DEV Board window for this as working inside the modules for and of the Mainframe.
author: Verren Nox
references:
    - https://www.trendmicro.com/en_us/research/22/a/cybersecurity-industrial-control-systems-ics-part-1.html
tags:
    -  attack.t1055.013 #Process-Hollowing
    -  attack.t1059.009 #Cloud-API
    -  attack.t1106 #Native-API
    -  attack.t1583.003 #Virtual-Private
    -  attack.t1071 #Application Layer Protocol
    -  attack.t1583.004 #Server
    -  attack.t1195 #Supply-Chain
    -  attack.tA0040 #Intent-Impact
    -  attack.t1578.004 #Revert Cloud Instance
    -  attack.t1480.001 #Environmental-Keying
    -  attack.t1190 #Exploit Facing Application
    -  attack.t1491 #OS Credential Trashing
    -  Opcode 1002 #Set_contact rate/client-server
    -  Opcode 1003 #Send list of installed Applications
logsource:
    #service: - Unicode A.i SOCprime
        #Binary smbclient-security  
    category:
    product: Windows/Microsoft/
detection:
         - Data Wrangler
         -'Binary Analysis'          
         -'Forensics'
    selection:
           - 'full-path-to-the-msp'
        ParentImage|endswith: 
            - '\SOFTWARE\Microsoft\Active Setup\Installed Components'
        Image|endswith:
            - '\StubPath'
        CommandLine|contains:
            - 'Historian_tool -server <server_address> -command <action>'
    condition: Processing
falsepositives:
    - That this of such Data threat wa it is apart of less Malware and more of a Developers root Shell/ DEV root Shell now being
      used. But the data Mainframe channel window from the Developer Board/ DEV Board. Might have derivities from couplings
      possibly Piartool.
level: high
id: 14a12e1b-3828-4022-8a3b-a6c14acdc5c8

